<a href="https://colab.research.google.com/github/mahimscit/DO180-apps/blob/master/SQL1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# CREATING THE TABLE
import sqlite3

conn = sqlite3.connect('test.db')
print("Opened database successfully");

conn.execute('''
CREATE TABLE Salesman (
    SalesmanId INT,
    Name VARCHAR(255),
    Commission DECIMAL(10, 2),
    City VARCHAR(255),
    Age INT
); ''')
conn.commit()

print("Table created successfully");

In [ ]:
conn.execute("INSERT INTO Salesman VALUES(101, 'Joe', 50, 'California', 17);")
conn.execute("INSERT INTO Salesman VALUES(102, 'Simon', 75, 'Texas', 25);")
conn.execute("INSERT INTO Salesman VALUES(103, 'Jessie', 105, 'Florida', 35);")
conn.execute("INSERT INTO Salesman VALUES(104, 'Danny', 100, 'Texas', 22);")
conn.execute("INSERT INTO Salesman VALUES(105, 'Lia', 65, 'New Jersey', 30);")

conn.commit()

In [ ]:
conn = sqlite3.connect('test.db')

cursor = conn.execute(''' SELECT * FROM Salesman;''')

for row in cursor:
  print(row)

(101, 'Joe', 50, 'California', 17)
(102, 'Simon', 75, 'Texas', 25)
(103, 'Jessie', 105, 'Florida', 35)
(104, 'Danny', 100, 'Texas', 22)
(105, 'Lia', 65, 'New Jersey', 30)

In [ ]:
# CREATING THE TABLE
import sqlite3

conn = sqlite3.connect('test.db')
print("Opened database successfully");

conn.execute('''
CREATE TABLE Customer (
    SalesmanId INT,
    CustomerId INT,
    CustomerName VARCHAR(255),
    PurchaseAmount INT
    ); ''')
conn.commit()

print("Table created successfully");

In [ ]:
conn.execute("INSERT INTO Customer VALUES(101, 2345, 'Andrew', 550);")
conn.execute("INSERT INTO Customer VALUES(103, 1575, 'Lucky', 4500);")
conn.execute("INSERT INTO Customer VALUES(104, 2345, 'Andrew', 4000);")
conn.execute("INSERT INTO Customer VALUES(107, 3747, 'Remona', 2700);")
conn.execute("INSERT INTO Customer VALUES(110, 4004, 'Julia', 4545);")

conn.commit()

In [ ]:
conn = sqlite3.connect('test.db')

cursor = conn.execute(''' SELECT * FROM Customer;''')

for row in cursor:
  print(row)

(101, 2345, 'Andrew', 550)
(103, 1575, 'Lucky', 4500)
(104, 2345, 'Andrew', 4000)
(107, 3747, 'Remona', 2700)
(110, 4004, 'Julia', 4545)

In [ ]:
# CREATING THE TABLE
import sqlite3

conn = sqlite3.connect('test.db')
print("Opened database successfully");

conn.execute('''
CREATE TABLE Orders (OrderId int, CustomerId int, SalesmanId int, Orderdate Date, Amount money); ''')
conn.commit()

print("Table created successfully");

Opened database successfully
Table created successfully

In [ ]:
conn.execute("INSERT INTO Orders VALUES(5001,2345,101,'2021-07-01',550);")
conn.execute("INSERT INTO Orders VALUES(5003,1234,105,'2022-02-15',1500);")

conn.commit()

In [ ]:
conn = sqlite3.connect('test.db')

cursor = conn.execute(''' SELECT * FROM Orders;''')

for row in cursor:
  print(row)

(5001, 2345, 101, '2021-07-01', 550)
(5003, 1234, 105, '2022-02-15', 1500)


1. Insert a new record in your Orders table.

In [ ]:
conn.execute("INSERT INTO Orders VALUES(5005,3747,108,'2023-12-01',750);")
conn.execute("INSERT INTO Orders VALUES(5007,4004,110,'2024-07-31',5600);")

conn.commit()

In [ ]:
conn = sqlite3.connect('test.db')

cursor = conn.execute(''' SELECT * FROM Orders;''')

for row in cursor:
  print(row)

(5001, 2345, 101, '2021-07-01', 550)
(5003, 1234, 105, '2022-02-15', 1500)
(5005, 3747, 108, '2023-12-01', 750)
(5007, 4004, 110, '2024-07-31', 5600)

2. Add Primary key constraint for SalesmanId column in Salesman table. Add default
constraint for City column in Salesman table. Add Foreign key constraint for SalesmanId
column in Customer table. Add not null constraint in Customer_name column for the
Customer table.

In [ ]:
import sqlite3
conn = sqlite3.connect('test.db')
cursor = conn.cursor()  # Create a new cursor object
print("Opened database successfully")

# Adding Primary Key to Salesman Table
# Use executescript for multiple statements
cursor.executescript("""
PRAGMA foreign_keys=off;
BEGIN TRANSACTION;
ALTER TABLE Salesman RENAME TO Salesman_old;
CREATE TABLE Salesman (
    SalesmanId INT PRIMARY KEY,
    Name VARCHAR(255),
    Commission DECIMAL(10, 2),
    City VARCHAR(255) DEFAULT 'Unknown',
    Age INT
);
INSERT INTO Salesman SELECT * FROM Salesman_old;
DROP TABLE Salesman_old;
COMMIT;
PRAGMA foreign_keys=on;
""")

# Adding Foreign Key and NOT NULL to Customer Table
# Use executescript for multiple statements
cursor.executescript("""
PRAGMA foreign_keys=off;
BEGIN TRANSACTION;
ALTER TABLE Customer RENAME TO Customer_old;
CREATE TABLE Customer (
    SalesmanId INT,
    CustomerId INT,
    CustomerName VARCHAR(255) NOT NULL,
    PurchaseAmount INT,
    FOREIGN KEY (SalesmanId) REFERENCES Salesman(SalesmanId)
    );
INSERT INTO Customer SELECT * FROM Customer_old;
DROP TABLE Customer_old;
COMMIT;
PRAGMA foreign_keys=on;
""")

conn.commit()
print("Table altered successfully")

Opened database successfully
Table altered successfully

3. Fetch the data where the Customer’s name is ending with ‘N’ also get the purchase
amount value greater than 500.

In [ ]:
import sqlite3

conn = sqlite3.connect('test.db')
cursor = conn.cursor()

cursor.execute("SELECT * FROM Customer WHERE CustomerName LIKE '%n' AND PurchaseAmount > 500")

results = cursor.fetchall()
for row in results:
    print(row)

4. Using SET operators, retrieve the first result with unique SalesmanId values from two
tables, and the other result containing SalesmanId with duplicates from two tables.

In [ ]:
import sqlite3

# Connect to the database
conn = sqlite3.connect('test.db')
cursor = conn.cursor()

# Query for unique SalesmanId values
cursor.execute("SELECT SalesmanId FROM Salesman UNION SELECT SalesmanId FROM Customer")
unique_salesman_ids = cursor.fetchall()
print("Unique SalesmanIds:", unique_salesman_ids)

# Query for SalesmanId with duplicates
cursor.execute("SELECT SalesmanId FROM Salesman INTERSECT SELECT SalesmanId FROM Customer")
duplicate_salesman_ids = cursor.fetchall()
print("Duplicate SalesmanIds:", duplicate_salesman_ids)

Unique SalesmanIds: [(101,), (102,), (103,), (104,), (105,), (107,), (110,)]
Duplicate SalesmanIds: [(101,), (103,), (104,)]

5. Display the below columns which has the matching data.
Orderdate, Salesman Name, Customer Name, Commission, and City which has the
range of Purchase Amount between 500 to 1500.

In [ ]:
import sqlite3

conn = sqlite3.connect('test.db')
cursor = conn.cursor()

# SQL query to join tables and filter data
query = """
SELECT o.Orderdate, s.Name AS SalesmanName, c.CustomerName, s.Commission, s.City
FROM Orders AS o
JOIN Customer AS c ON o.CustomerId = c.CustomerId
JOIN Salesman AS s ON o.SalesmanId = s.SalesmanId
WHERE c.PurchaseAmount BETWEEN 500 AND 1500;
"""

cursor.execute(query)
results = cursor.fetchall()

# Print the results
for row in results:
    print(row)

('2021-07-01', 'Joe', 'Andrew', 50, 'California')

6. Using right join fetch all the results from Salesman and Orders table.

In [ ]:
import sqlite3

conn = sqlite3.connect('test.db')
cursor = conn.cursor()

# SQL query with LEFT JOIN to simulate RIGHT JOIN
# Switch the order of tables and use LEFT JOIN
query = """
SELECT *
FROM Orders AS o
LEFT JOIN Salesman AS s ON s.SalesmanId = o.SalesmanId;
"""
#The above query uses a LEFT JOIN instead of a RIGHT JOIN.
#To achieve the same result as a RIGHT JOIN, the order of the tables in the FROM clause has been reversed, and a LEFT JOIN is used.
#This way, all rows from the Orders table will be included, and matching rows from the Salesman table will be joined. If there's no match in the Salesman table, the columns from Salesman will have NULL values.


cursor.execute(query)
results = cursor.fetchall()

# Print the results
for row in results:
    print(row)

(5001, 2345, 101, '2021-07-01', 550, 101, 'Joe', 50, 'California', 17)
(5003, 1234, 105, '2022-02-15', 1500, 105, 'Lia', 65, 'New Jersey', 30)
(5005, 3747, 108, '2023-12-01', 750, None, None, None, None, None)
(5007, 4004, 110, '2024-07-31', 5600, None, None, None, None, None)